-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        11.7.2-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.10.0.7000
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;


-- sys 데이터베이스 구조 내보내기
CREATE DATABASE IF NOT EXISTS `sys` /*!40100 DEFAULT CHARACTER SET utf8mb3 COLLATE utf8mb3_general_ci */;
USE `sys`;

-- 테이블 sys.sbusiness 구조 내보내기
CREATE TABLE IF NOT EXISTS `sbusiness` (
  `business_name` varchar(100) NOT NULL,
  `category` text DEFAULT NULL,
  `address` text DEFAULT NULL,
  `category_major` text DEFAULT NULL,
  `category_middle` text DEFAULT NULL,
  `category_detail` text DEFAULT NULL,
  `recommended_agency_name` varchar(100) DEFAULT NULL,
  `match_score` float DEFAULT NULL,
  PRIMARY KEY (`business_name`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- 테이블 데이터 sys.sbusiness:~62 rows (대략적) 내보내기
INSERT INTO `sbusiness` (`business_name`, `category`, `address`, `category_major`, `category_middle`, `category_detail`, `recommended_agency_name`, `match_score`) VALUES
	('GS25관악로점', '종합소매점', '서울특별시 관악구 봉천동 851-3', '소매', '종합소매점', '편의점', '미디어브랜즈코리아식회사', 36),
	('GS25동작서림', '종합소매점', '서울특별시 동작구 사당동 252-17', '소매', '종합소매점', '편의점', '미디어브랜즈코리아식회사', 37.7),
	('GS25보라매타운점', '종합소매점', '서울특별시 관악구 봉천동 729-24', '소매', '종합소매점', '편의점', '미디어브랜즈코리아식회사', 36),
	('강남곱창이야기', '한식', '서울특별시 강남구 역삼동 687', '음식', '한식', '곱창/양구이전문', '코래드', 49.5),
	('강남발머스한의원', '병원', '서울특별시 강남구 역삼동 823-24', '의료', '병원', '한의원', '어비즈', 57.2),
	('강원전통식품', '음/식료품소매', '서울특별시 서초구 양재동 232', '소매', '음/식료품소매', '식료품점', '스푼식회사', 48.1),
	('고봉민김밥', '분식', '서울특별시 양천구 신정동 323-17', '음식', '분식', '라면김밥분식', '케이이씨씨', 36.4),
	('그린퓨전', '한식', '서울특별시 영등포구 대림동 689', '음식', '한식', '한식/백반/한정식', '케이이씨씨', 40.8),
	('김밥천국', '분식', '서울특별시 금천구 독산동 291-5', '음식', '분식', '라면김밥분식', '케이이씨씨', 38.8),
	('남선푸드', '음/식료품소매', '서울특별시 영등포구 영등포동4가 442', '소매', '음/식료품소매', '반찬가게', '케이이씨씨', 40.7),
	('대박환경', '세탁/가사서비스', '서울특별시 금천구 시흥동 984', '생활서비스', '세탁/가사서비스', '청소/소독', '이노션', 43.1),
	('대원상회', '음/식료품소매', '서울특별시 동작구 노량진동 13-8', '소매', '음/식료품소매', '건어물상', '케이이씨씨', 43.4),
	('대원제약', '은행', '서울특별시 성동구 용답동 229-3', '금융', '은행', '은행', '한피알', 37.4),
	('대치떡방', '식품가공/제조', '서울특별시 구로구 구로동 3-25', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 37.5),
	('동일중학교', '학교', '서울특별시 금천구 시흥동 100-4', '학문/교육', '학교', '중학교', '미디어브랜즈코리아식회사', 31.3),
	('동화인터내셔널', '유아교육', '서울특별시 금천구 독산동 291-1', '학문/교육', '유아교육', '동화구연', '미디어브랜즈코리아식회사', 31.2),
	('두드림', '화장품소매', '서울특별시 중랑구 중화동 450', '소매', '화장품소매', '화장품판매점', '한피알', 34.2),
	('두영에프앤디', '식품가공/제조', '서울특별시 서초구 반포동 19-3', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 45.7),
	('로데오축산', '음/식료품소매', '서울특별시 양천구 신정동 883', '소매', '음/식료품소매', '육류소매', '케이이씨씨', 37.1),
	('로코스9', '화장품/비누/세정제도매', '서울특별시 성북구 하월곡동 227', '도매/유통/무역', '화장품/비누/세정제도매', '화장품/비누/세정제도매-종합', '맥브레인즈', 62.8),
	('롯데리아', '패스트푸드', '서울특별시 양천구 신정동 1190-3', '음식', '패스트푸드', '패스트푸드', '케이이씨씨', 35.3),
	('마트네깜순이네', '운동/경기용품소매', '서울특별시 강남구 논현동 235', '소매', '운동/경기용품소매', '운동/경기용품', '메이트인디펜던스', 44.4),
	('메르디앙베이커리', '식품가공/제조', '서울특별시 서초구 반포동 55-6', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 45.7),
	('명암산채', '식품가공/제조', '서울특별시 강남구 역삼동 755', '제조', '식품가공/제조', '종합식품제조', '코래드', 47.3),
	('미녀의탄생', '이/미용/건강', '서울특별시 동대문구 장안동 336', '생활서비스', '이/미용/건강', '비만/피부관리', '한피알', 36.6),
	('미니', '양식', '서울특별시 서초구 반포동 816', '음식', '양식', '정통양식/경양식', '케이이씨씨', 45.4),
	('미자', '분식', '서울특별시 관악구 신림동 1640-31', '음식', '분식', '라면김밥분식', '케이이씨씨', 41.4),
	('바이칼허브', '건강/미용식품', '서울특별시 강서구 화곡동 894-19', '소매', '건강/미용식품', '건강식품판매', '어썸메이크', 40.1),
	('박준뷰티랩', '이/미용/건강', '서울특별시 동작구 사당동 1031-27', '생활서비스', '이/미용/건강', '비만/피부관리', '미디어브랜즈코리아식회사', 36.8),
	('베스트호프', '유흥주점', '서울특별시 영등포구 대림동 864-10', '음식', '유흥주점', '호프/맥주', '케이이씨씨', 39.1),
	('사과나무', '분식', '서울특별시 금천구 가산동 60-24', '음식', '분식', '라면김밥분식', '케이이씨씨', 38.3),
	('삼성제약헬스케어', '제약업', '서울특별시 강남구 역삼동 747-19', '제조', '제약업', '제약업-기타', '코래드', 46.3),
	('샷업', '양식', '서울특별시 강남구 신사동 661', '음식', '양식', '정통양식/경양식', '그레이월드와이드코리아', 47),
	('서울연인단팥빵본점', '식품가공/제조', '서울특별시 강남구 역삼동 707-9', '제조', '식품가공/제조', '빵/과자제조-종합', '코래드', 47.3),
	('소비자지킴이봉사단', '한식', '서울특별시 구로구 구로동 621-8', '음식', '한식', '한식/백반/한정식', '케이이씨씨', 39.7),
	('슈크레동목동', '제과제빵떡케익', '서울특별시 양천구 신정동 323-7', '음식', '제과제빵떡케익', '제과점', '케이이씨씨', 35.3),
	('시드니', '유흥주점', '서울특별시 양천구 신정동 117-36', '음식', '유흥주점', '룸살롱/단란주점', '케이이씨씨', 35.8),
	('신원씨푸드', '음/식료품소매', '서울특별시 관악구 봉천동 729-22', '소매', '음/식료품소매', '반찬가게', '케이이씨씨', 43.4),
	('싱싱포차', '한식', '서울특별시 구로구 오류동 36-1', '음식', '한식', '한식/백반/한정식', '케이이씨씨', 36.4),
	('아리따움', '화장품소매', '서울특별시 성동구 성수동2가 273-19', '소매', '화장품소매', '화장품판매점', '한피알', 39.2),
	('아리수식품', '음/식료품소매', '서울특별시 구로구 신도림동 692', '소매', '음/식료품소매', '식료품점', '케이이씨씨', 39.3),
	('아이넷라이프', '장례/묘지', '서울특별시 서초구 양재동 107', '생활서비스', '장례/묘지', '장의사/관련서비스-종합', '메디커뮤니케이션', 47.6),
	('에이치에비뉴호텔역삼', '한식', '서울특별시 강남구 역삼동 678-14', '음식', '한식', '한식/백반/한정식', '코래드', 49.5),
	('우리에프엔지', '식품가공/제조', '서울특별시 구로구 구로동 188-26', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 37.5),
	('우리이발관', '이/미용/건강', '서울특별시 금천구 독산동 898-21', '생활서비스', '이/미용/건강', '남성미용실', '미디어브랜즈코리아식회사', 31.4),
	('위드유', '대행업', '서울특별시 금천구 시흥동 998', '생활서비스', '대행업', '사무대리서비스', '미디어브랜즈코리아식회사', 31.2),
	('전주익산', '한식', '서울특별시 관악구 신림동 1640-31', '음식', '한식', '한식/백반/한정식', '케이이씨씨', 42.5),
	('참다한홍삼', '건강/미용식품', '서울특별시 양천구 목동 907-7', '소매', '건강/미용식품', '인삼제품판매', '어썸메이크', 42.3),
	('천지식품', '음/식료품소매', '서울특별시 관악구 신림동 541', '소매', '음/식료품소매', '식료품점', '케이이씨씨', 42.1),
	('카페숨', '커피점/카페', '서울특별시 동작구 상도동 463-11', '음식', '커피점/카페', '커피전문점/카페/다방', '케이이씨씨', 40.4),
	('케이투디', '식품가공/제조', '서울특별시 구로구 구로동 636-89', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 37.5),
	('클랑도쿄빵야', '양식', '서울특별시 강남구 신사동 543-8', '음식', '양식', '정통양식/경양식', '그레이월드와이드코리아', 47),
	('통큰한방화장품', '화장품소매', '서울특별시 성동구 성수동2가 300-6', '소매', '화장품소매', '화장품판매점', '한피알', 39.4),
	('파마푸드코리아', '식품가공/제조', '서울특별시 강남구 역삼동 702-10', '제조', '식품가공/제조', '종합식품제조', '코래드', 47.3),
	('파인생활건강', '이/미용/건강', '서울특별시 관악구 봉천동 735-11', '생활서비스', '이/미용/건강', '건강제품', '미디어브랜즈코리아식회사', 42.5),
	('피자스쿨', '한식', '서울특별시 서초구 우면동 66-1', '음식', '한식', '한식/백반/한정식', '스푼식회사', 47.2),
	('하나롤', '분식', '서울특별시 영등포구 영등포동4가 434-5', '음식', '분식', '스낵', '케이이씨씨', 40.1),
	('한국야쿠르트봉일점', '음/식료품소매', '서울특별시 관악구 봉천동 44-14', '소매', '음/식료품소매', '우유판매', '케이이씨씨', 43.4),
	('한비건강식품', '건강/미용식품', '서울특별시 관악구 신림동 607-73', '소매', '건강/미용식품', '건강식품판매', '어썸메이크', 45.7),
	('허니문폐백이바지', '식품가공/제조', '서울특별시 금천구 독산동 880-24', '제조', '식품가공/제조', '종합식품제조', '케이이씨씨', 37.7),
	('호텔베르누이', '양식', '서울특별시 구로구 오류동 31-277', '음식', '양식', '정통양식/경양식', '케이이씨씨', 33.8),
	('희원비지니스', '유흥주점', '서울특별시 관악구 신림동 1425-29', '음식', '유흥주점', '기타일반유흥주점', '케이이씨씨', 40.8);

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
